---
kind: property
id: P:Autodesk.Revit.DB.DimensionSegmentArray.Item(System.Int32)
source: html/debfe808-4d56-9ee8-59e3-2560f2e6cbaf.htm
---
# Autodesk.Revit.DB.DimensionSegmentArray.Item Property

Gets or sets an item at a specified index within the array.

## Syntax (C#)
```csharp
public virtual DimensionSegment this[
	int index
] { get; set; }
```

## Parameters
- **index** (`System.Int32`) - The index of the item to be set or retrieved.

## Returns
Returns the object at the specified index.